#-*- coding:utf-8 -*-
para1 = """國民黨台北市長參選人連勝文今天表示，日前與前民進黨主席施明德討論在北市建祠，表彰對台貢獻的先賢；至於施明德以自己是新北市民，不介入北市選戰，他尊重施的選擇。為感念先賢，中國國民黨台北市長參選人連勝文今天到228紀念公園，向曾祖父連橫，以及劉銘傳、鄭成功和邱逢甲等人的銅像獻花和鞠躬追思。連勝文會後受訪表示，他先前與施明德見面，對於台灣過去幾百年來不同階段，來自不同族群、背景和地方的前輩們對台灣的貢獻，應該要有特別處所表彰其建設和貢獻，他對此觀念相當認同。他指出，對台北市來說，也很希望朝此方向推動，建設一個感念處所，讓後輩知道過去先人建設台灣所付出的努力。連勝文表示，他曾向許多前輩請教過，包括施明德在內，施明德也很清楚說自己是新北市民，所以不會特別介入北市選舉，他也很尊重施明德的選擇，最重要的是感謝其對台灣的發展和兩岸關係想法，是很好的參考和思維。由於連勝文今天未出席兩岸食安論壇，外界傳聞是連勝文避開和柯文哲同台，不過連陣營發言人錢震宇表示，連勝文因早已排定既定行程，因此不克出席論壇活動。"""
para2 = """年底九合一選舉今（27）日進行候選人號次抽籤，在台北市長部分，國民黨台北市長候選人連勝文抽中6號，無黨籍台北市長候選人柯文哲抽中7號。連勝文和柯文哲今天都沒有親自到場，連陣營派出連勝文競選總部主委陳炯松、及國民黨台北市黨部主委鍾則良代表出席，柯營部分則由公民顧問團團長紀政代表抽籤。台北市有七位候選人，無黨籍台北市長候選人馮光遠抽中5號，連勝文抽中6號，柯文哲抽中7號，三人號次連在一起，令在場採訪的媒體驚呼「真的是太巧了」。"""
para3 = """
十八屆三中全會通過的《中共中央關於全面深化改革若干重大問題的決定》明確指出，節能環保作為民生關注的重點，成為了建設生態文明、關係人民福祉、關乎民族未來的大事、實事。由於自然資源是不可再生的，在社會飛速發展的今天，工業始終是能耗大戶，因而，對於如何降低能耗、提高節能效果的問題，無疑成為上至政府下至企業主未來謀劃產業升級的頭等大事。國務院總理李克強曾指出，節能環保產業在中國擁有巨大市場，可以成為推動經濟發展的支柱產業，政府鼓勵民營和社會資本進入這一領域。國家發改委一位官員也表示，目前從中央到地方，都在制定一些涉及節能環保產業的規劃，將節能環保產業打造成支柱產業，有利於國內產業的轉型升級。台達集團資深副總裁暨機電事業群總經理張訓海表示："中國製造業規模非常龐大，人口又非常多，能源使用效率較歐美發達國家還有很大差距，建築物、工廠、交通、民生，每個細分領域都不同，怎麼用電更有效率，更符合生產實際，如何在每一個環節上降低能耗才是最重要的。所以節能環保產業未來在國內擁有非常巨大的發展空間，這其中最主要的問題就是能源使用效率不高。" 
"""

para4 = """
台積電(2330)今(27日)舉辦一年一度的運動會，董事長張忠謀也和妻子張淑芬共同出席。而今年適逢台積電25週年，包括張忠謀、妻子張淑芬，以及台積電3位執行副總暨共同營運長蔣尚義、劉德音、魏哲家均連袂出席。由張忠謀帶頭的經營團隊今日難得輕鬆穿著運動服裝，董事長夫人張淑芬也不時拿著智慧型手機拍攝運動會現場。台積電今日運動會流程，依序為開幕典禮、區隊進場、聖火點燃、董事長致詞、活力健康操、啦啦隊表演，接著則是主管趣味競走、女子/男子3000公尺、女子/男子100公尺、男女400公尺混合接力、350公尺障礙賽、6000公尺大隊接力、夫妻200公尺接力、親子100公尺接力，以及拔河等趣味競賽。而聖火傳遞年資1-25年的資淺員工依序交到資深員工手上，最後傳到台積電資深副總曾繁城之手，再由董事長張忠謀帶領倒數點燃，齊聲呼喊「我愛台積，再創奇蹟」的口號來提振士氣。張忠謀日前於法說會上預告，今年是台積電成立25週年，運動會是台積電一年一度的活動，估計有上萬名員工以及家眷都會一同參與，場面將很盛大，而他也感性表示，對台積電的員工，他每天都會想到他們。全文網址: http://www.moneydj.com/KMDJ/News/NewsViewer.aspx?a=7856dcf4-bdba-4a4b-ab59-b17fe0ec3915#ixzz3HJsDyjyM 
MoneyDJ 財經知識庫 
"""
para5 = """
台達電（2308）昨（26）日宣布與建達國際合作，推廣台達InfraSuite資料中心基礎設施解決方案及不斷電系統，全台新增逾6,000個銷售據點。台達電董事長海英俊表示，希望未來三年內，在中小市場搶占市占率第一，每年營收目標成長55%。海英俊表示，台達電已進入品牌時代，2010年定位為品牌元年，但品牌沒有通路，等於白做，建達在全台擁有逾6,000個據點，比超商龍頭統一超還多，如果台達電自己投入布建，不知道要花多少年。因此，品牌必須與通路商緊密合作，只有代理商成功、賺錢，品牌商才能跟著獲利。建達國際總經理林鴻禧表示，台達深耕電源與散熱管理方案多年，資料中心產品與解決方案在市場具領先地位，其專業的技術能力，幫助更多用戶強化電力確保關鍵營運不間斷，InfraSuite資料中心基礎設施解決方案，為客戶節省逾25%能耗，讓機房運作更加環保。透過雙方合作，將可建立更寬廣的銷售網絡，共創營收新高峰，帶來「一加一大於二的雙贏綜效」。台達關鍵基礎架構事業部總經理蔡文蔭表示，台達電InfraSuite資料中心基礎設施解決方案在台灣主攻重量級電子大廠，為擴展通路廣度，未來藉由結合建達綿密的物流或維修網絡，三年內，在中小市場綠色機房市占率搶占第一。目前先以台灣市場為主，未來著眼大陸市場，不排除在中達電通之外，分省區尋求不同代理商。
"""
para6 = """
廣達今年尾牙宴，林百里以「雲中君」扮相上場。 報系資料照 「壹週刊」昨天報導，廣達董事長林百里癌症復發，去年九月下旬切除一片肺葉，休養四個月沒有公開行程，直到前陣子廣達尾牙才公開露面。
"""

para7 = """
中國媒體22日報導《新華社》拍攝一張中國國家主席習近平撐傘照「習近平冒雨考察武漢新港」，贏得第24屆中國新聞獎的新聞攝影一等獎。這張照片很快就被網友拿來二次創作，圖中習繫黃絲帶，撐著黃色雨傘，旁有「一起舉傘，一起的撐！」文字，製成看板放置在集會區。
"""

para8 = """
台北一○一今將召開董事會，財政部長張盛和昨再度喊話，要求魏家應主動退出經營權，行政院也隨即表態支持；但卻碰了個軟釘子，魏應交昨僅透過幕僚回應，強調他擔任台北一○一副董事長兼總經理期間，各項經營績效「有目共睹」，「個人去留，尊重台北一○一董事會的決定，沒有任何預設立場」。頂新集團看似姿態柔軟，但對退出經營權一事，並未鬆口。朝野立委昨在立法院財政委員會痛批財長張盛和，只會嘴巴宣示要將台北一○一副董事長及總經理職位一併取回，但在董事會召開前竟未積極部署，也未提案召開臨時股東會，根本是「打空包彈」。國民黨立委賴士葆質疑，台北一○一公股雖掌握六席董事，但副董事長、總經理都是魏家掌握，經營權形同「淪陷」。他批評財政部「嘴巴很硬，動作很軟」，明知重大議案需在會議前七天提出，「火燒眉毛了，財政部卻啥動作都沒有，只會在這裡信誓旦旦」，張盛和根本是在講空話。民進黨立委吳秉叡也批評，魏家雖然投資台北一○一約五十四億元，但其中竟有八十七％是銀行貸款，「魏家只出十三％、約六億元的錢，就能來跟公股搶經營權」，根本是做無本生意；他要求財政部調查頂新究竟跟哪些銀行質押股權，若魏家打算爭奪經營權，就要他們把所有貸款還清、「抽銀根」，「假如做不到，就是財政部長無能」。張盛和對此僅回應，此次董事會是例行會議，明年才會進行董監改選，現在說要拿回經營權只是「喊爽的」，公股尚未縝密布局，目前實力還不夠，沒辦法逼迫魏家交出經營權，「若魏家願意自行退出台北一○一經營，當然是最好」。但他當場承諾，會請公股代表於董事會上提「臨時動議」，要求魏應交辭去副董事長兼總經理（執行長）職位，未來再透過改選，讓魏家交出經營權；不過，財政部政務次長吳當傑昨晚改口表示，今天台北一○一董事會將不會提出臨時動議，但會請公股代表主動發言「建議」魏家自行退出經營權。他表示，希望魏家能知所進退，但「總是要給他們一些思考空間」，若魏家仍堅持不退出，不排除在兩個月後的董事會正式提案。另一民股的國泰世華表示，此案根本沒在議程裡，且臨時動議需在七天前提出、也沒聽說，不方便評論。由藝人郭桂彬、搖滾歌手砰砰阿峰為首組成的「打擊黑心企業行動聯盟」則表示，今將號召千人包圍一○一大樓，要求頂新全面退出一○一經營並出面接受抗議，否則將直上頂新總部抗議。國民黨台北市長候選人連勝文陣營昨天晚上也發布新聞稿，強調頂新集團應該立即退出一○一董事會及一○一經營團隊。
"""
para9 = """
新華網北京10月27日電 中共中央總書記、國家主席、中央軍委主席、中央全面深化改革領導小組組長習近平10月27日上午主持召開中央全面深化改革領導小組第六次會議並發表重要講話。他強調，黨的十八屆四中全會通過了全面推進依法治國的決定，與黨的十八屆三中全會通過的全面深化改革的決定形成了姊妹篇。全面深化改革需要法治保障，全面推進依法治國也需要深化改革。學習貫徹黨的十八屆四中全會精神是當前和今後一個時期全黨全國的重大政治任務，各地區各部門務必抓緊抓好，切實提高運用法治思維和法治方式推進改革的能力和水平。中共中央政治局常委、中央全面深化改革領導小組副組長李克強、劉雲山出席會議。
"""
para10 = """
陽光高雄重建中心於10月16日在高雄市舉辦開幕記者會，高雄市長陳菊、社會局長張乃千及各局處長官、醫界代表與台達電子文教基金會、康健人壽、HOTEL Dua (都會生活開發股份有限公司)、台灣巴斯夫股份有限公司、台灣凸版國際彩光股份有限公司、萬泰國際物流有限公司等企業代表均蒞臨支持。高雄市長陳菊表示：「歷經81氣爆後，她曾有近1個月的時間天天往返醫院、殯儀館，面對無辜受創的民眾，她感同身受，自己也有災後症候群導致有睡眠不穩問題，所以她可以體會氣爆傷者的心情，尤其燒燙傷的朋友們要面臨更多生心理復健所帶來的挑戰，她勉勵傷友們要堅強，重新再起。高雄市政府感謝有陽光高雄重建中心的設立，感謝陽光基金會為傷者伸出援手，鼓勵並協助傷者復健，讓傷者免南北奔波，盼完整的復健課程，有助於傷者早日恢復正常生活，也允諾將全力支持！」高雄氣爆多名傷者也齊聚記者會現場，過去一個多月來，部分傷者已在陽光南區服務中心陸續展開復健，如今得知高雄重建中心開幕，皆表示感謝欣慰；此外甫完成復健的高雄在地傷友更親臨現場分享其復健的心路歷程，期盼81氣爆傷友也能像他們一樣得到浴火重生的力量。聯合勸募協會張來川常務理事、陽光基金會馬海霞董事長、高雄市長陳菊、台達電子文教基金會張楊乾副執行長一同為陽光高雄重建中心揭牌。
"""

para11 = """
「富比世」（Forbes）雜誌今天表示，電子商務巨擘阿里巴巴集團創辦人馬雲是中國大陸首大富豪，身價近200億美元；儘管大陸經濟走緩，億萬富豪人數依舊增加。富比世在年度「中國富豪排行榜」指出，大陸富豪人數由2013年的168人激增至今年的242人。根據富比世，阿里巴巴9月在美國紐約證券交易所首度公開上市（IPO）金額破紀錄後，馬雲個人財富由去年71億美元銳增至195億美元。上月在大陸胡潤富豪排行榜中，馬雲也高居榜首，胡潤認為他的財富更多，估計有250億美元。
阿里巴巴由馬雲與友人15年前集資6萬美元創立，在美國上市之後，目前市值超過2400億美元。大陸版谷歌（Google）百度創辦人李彥宏以147億美元名列第2，騰訊（Tencent）的馬化騰以144億美元位居第3。騰訊是大陸人氣最高的通訊應用程式微信的母公司。去年榜首大連萬達集團董事長王健林，今年被踢下寶座落居第4。富比世指出，王健林財富主要來源為國內的房地產業，不過房地產面臨「充滿挑戰」的1年，王健林的資產由去年141億美元萎縮至132億美元。5至10名分別是：再生能源企業漢能控股集團李河君（130億美元）、娃哈哈集團創辦人宗慶後（110億美元）、有色金屬業者正威國際集團董事長王文銀（100億美元）、小米手機創辦人雷軍（91億美元）、美的電器創辦人何享健（75億美元）、京東商城創辦人劉強東（71億美元）。
"""
para12 = """
詩人蒲柏（Alexander Pope）說：「自然和自然法則總是藏在暗夜裡（Nature and nature’s law lay hid in the night）。」 暗夜裡處處有物理的驚奇。  在SARS風暴下，諾貝爾獎得主丁肇中日前來台，獲頒交通大學榮譽博士。平日嚴謹的大師，與二十世紀物理相約的開場白是，「我喜歡在黑暗中說話。」人類對於未知，就像暗夜迷航。二十一世紀人類最宏偉的科學探索工程——「太空反物質探索計畫」，主持人就是丁肇中。該計畫預計2005年10月發射太空反物質（AMS）磁譜儀，在國際聯合空間站上，長期觀測宇宙射線，以揭開宇宙大爆炸時的「暗物質」與「反物質」永恆之謎。和物理大師相遇，就像科幻小說一樣驚奇。丁肇中相信，宇宙的另一半空間裡，有一個「反物質」世界；而90％的宇宙，可能是由神祕的「暗物質」統治。陰陽相生，相生又相剋。到底什麼是反物質？他形容，當物質世界的諾貝爾獎得主丁肇中，和另一個反物質世界的丁肇中握手時，兩人同時消失，幻化成一道白光。我們一直以為人類存在的世界是「物質」世界，事實上1930年英國物理學家狄拉克（Paul Adrien Maurice Dirac）在粒子加速器中發現，宇宙其實成對創生，另外應該還有一個「反物質」世界。國際太空反物質探索計畫」被認為是本世紀初太空高能物理領域最重要的研究計畫，共有十六國，六十多個研究機構，四百多位科學家參與。國內的中央研究院、中山科學研究院、中央大學、國科會太空計畫室、成功大學，也參與了整個計畫中最重要的電子儀器及超導磁鐵的設計製造及整測。
"""

para13 = """
台灣的大學數目太多，導致大學生供過於求，外界將矛頭對準中研院前院長李遠哲，但教育部前部長黃榮村今指出，李遠哲蠻冤枉的。
"""

para14 = """
高雄市長陳菊今天與教育局長范巽綠聯袂為高雄美國學校新校舍剪綵，陳菊期盼美國學校能加強與在地學校交流，增進高市教育國際化。

高雄美國學校提供美僑學生從幼稚園到高中一貫學習的美式校園；新校舍以「校園美學」為主軸，教室引進自然光採光設計，符合美國綠建築銀級設計標準；校內音樂廳、演講廳等設備現代化，未來還將陸續完成體育館、健身中心與游泳池等設施，學習環境優質。

美國學校新校區從2013年9月動土至今，經歷500多個日子落成。

陳菊下午出席新校舍啟用典禮，隨後並巡禮校園，她盛讚校舍設計融合自然與現代不同風格，並期許高雄市有更多學校和美國學校師生建立「學習共同體」，互相交流學習。

陳菊說，過去美國學校的圍牆上有鐵絲網，但她認為高雄是座友善城市，政府和人民對美國人非常友好，市府也會對美國學校師生的安全負起責任，因此美國學校從善如流把鐵絲網拆了，讓校園景觀美化不少，更有親和力。

美國學校先後租借高雄長庚醫院宿舍、福東國小、勝利國小舊校區為校舍，最後選在勝利國小舊校區興建校舍，施工期間，學生上課時依然能專注學習及遵守常規。舊校舍中品質尚佳的家具也規劃捐贈需用單位，教育學子惜福愛物。

教育局說，新校舍落成不僅讓勝利國小舊校園能活化善用，也創造不同面向的台美教育合作。

高雄美國學校期望，透過新校區，落實美式教育概念，發展為亞洲地區一流學校，鼓勵更多外僑來高雄落地深耕，也促進高雄國際化。
喧騰一時的國華人壽掏空案，台北地方法院今天下午宣判，被控主導掏空46.68億元的翁大銘四兄弟，因翁大銘、翁一銘及其他3名被告等5人已死亡，合議庭判決公訴不受理，翁有銘和翁德銘和國華人壽前董事長張貞松則通緝中，其餘8名被告分別依背信及偽造文書罪判處有期徒刑5年至10月不等，全案可上訴。
台中市民進黨議員張耀中、陳世凱、張芬郁今天上午召開記者會，要求市府停辦2018台中花博，張耀中等人指出，花博有四大難題待解決，包括工程零進度，中央經費未到位、經辦人力不足，加上台中花博預定在201811月開幕，時間洽逢九合一的全國大選，這四大問題未解決，恐演變成台中花博風暴。

市長林佳龍回應指出，他一上任就遇到土地取得問題，后里一塊展覽土地發現保育動物石虎，市府發揮效率，立即更換土地，並且取得行政院的支持，「花博計劃非常完整」，他強調，不論土地取得、藏館、未來展覽主題都有詳劃規劃，對於落後的進度已逐漸趕上，他有信心，也請議員支持，花博會辦的非常好。 林佳龍指出，花博預算編列81億元，市府共規劃「1+2+10」，有后里的主展區，加豐原、外埔，能構成北台中城市改造，整個台中也有10個花博展區，台中將有不同城市風貌。
"""
para15="""
寶成集團(9904)執行長CEO蔡佩君昨(7)日舉行婚禮，新郎谷有為是德商網訊科技台灣區總經理，並是政界名人、曾任世界人民反共聯盟主席谷正綱的孫子，此場婚禮相當低調，僅席開38桌。蔡佩君為寶成總裁蔡其瑞長女，2年前接任集團執行長一執，近2年連續經歷了大陸和越南廠的罷工事件，但寶成已重回成長，接班後已掌握大局。「谷蔡聯姻」由前南投縣長林源朗擔任介紹人，前副總經蕭萬長擔任證婚人，並有重要商界人士到場祝賀，包括潤泰集團總裁尹衍樑、富邦金(2881)董事長蔡明忠等。寶成集團總裁蔡其瑞(見附圖右)則於婚宴前親自為媒體介紹兩位新人，他首先感謝媒體對蔡佩君的關心，稱讚女兒貼心、乖巧，也表達對女婿滿意，認為他是真誠、誠實、做事態度很好的年輕人。蔡其瑞表示，對這場婚禮非常高興，因為這個女兒從小就非常貼心，而且很乖巧，在美國唸大學時，人家要唸4年，她只唸了3年就畢業，因為趕著回來幫老爸的忙。他並稱讚女兒，從華頓商學院畢業後返台，在他身邊工作10年，沒領一分薪水，因為她抱著學習的心態。
據了解，蔡佩君在2002年加入寶成國際集團，擔任蔡其瑞的特別助理，並在子公司裕元工業擔任董事，也曾任兆豐金(2886)董事，2年前接班擔任集團執行長一職。蔡其瑞說，她非常辛苦，一個人扛著寶成全球40多萬個員工、40多萬個家庭的生活，每個月出上千萬雙的鞋，並服務數10個品牌客戶，他一度擔心她事業心太重不想結婚，內心總期盼她每天上班下班能有個伴，現在有人能夠陪伴她，非常好。
蔡佩君和谷有為去年因業務關係認識，彼此個性契合，進而成為知心朋友，蔡其瑞說，他一生能回饋社會的事都盡量做，這段姻緣感謝老天爺幫忙。寶成集團是全球最大製鞋代工廠，集團去年合併營收逾2,439億元，創歷史新高。目前集團總員工數超過41萬人，去年總計生產3.07億雙各式休閒及運動鞋，全球市占率約20%，即全球每5雙運動或休閒鞋中，就有1雙來自寶成，穩居全球製鞋龍頭。而蔡佩君為蔡其瑞長女，今年35歲，今年1月中在台北與大她3歲的谷有為訂婚；蔡佩君有兩個妹妹，分別為蔡明潔及蔡依珍，蔡明潔在2010年嫁給知名退休牙醫師曹文雄的長子曹恩華，最小的妹妹蔡依珍則日前訂婚，男方為鹿港人，正在美國攻讀博士，兩人今年9月可望完成終身大事。
"""

text = ["中華民國總統馬英九今天上午參加活動", "國民黨候選人連勝文的黃金切割"]
